conf/src/DataProcessors/Планирование/Планирование.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>Планирование</name>
</mdclass:DataProcessor>

conf/src/InformationRegisters/ЗаписиПлана/ЗаписиПлана.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЗаписиПлана</name>
  <resources>
    <name>ПланируемыеТрудозатраты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Цель</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Достигнуто</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПеренестиВСледующийПлан</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Результат</name>
    <type>
      <types>EnumRef.РезультатыВыполненияПланируемыхРабот</types>
    </type>
  </attributes>
  <dimensions>
    <name>ИдентификаторПлана</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Работа</name>
    <type>
      <types>CatalogRef.ТехническиеПроекты</types>
      <types>CatalogRef.ВидыДеятельности</types>
      <types>CatalogRef.ЗадачиПроцесса</types>
      <types>CatalogRef.Ошибки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипСтрокиПлана</name>
    <type>
      <types>EnumRef.ТипыСтрокПлана</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Группировка</name>
    <type>
      <types>CatalogRef.ТехническиеПроекты</types>
      <types>EnumRef.ТипыГруппировокСтрокПлана</types>
      <types>CatalogRef.ВидыДеятельности</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

conf/src/InformationRegisters/Планы/Планы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Планы</name>
  <attributes>
    <name>ВидПлана</name>
    <type>
      <types>CatalogRef.ВидыПланов</types>
    </type>
  </attributes>
  <attributes>
    <name>НачалоПериода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КонецПериода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Зафиксирован</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьЗаписи</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>ИдентификаторПлана</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

conf/src/InformationRegisters/ИерархияЗадачПроцесса/ИерархияЗадачПроцесса.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ИерархияЗадачПроцесса</name>
  <resources>
    <name>Уровень</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ЗадачаПроцесса</name>
    <type>
      <types>CatalogRef.ЗадачиПроцесса</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Родитель</name>
    <type>
      <types>CatalogRef.ЗадачиПроцесса</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

conf/src/InformationRegisters/ИтогиСогласованияЗадачРесурсов/ИтогиСогласованияЗадачРесурсов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ИтогиСогласованияЗадачРесурсов</name>
  <resources>
    <name>Запланировано</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Согласовано</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЗапланированоВДочерних</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СогласованоВДочерних</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВыполненоСогласованоВДочерних</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВыполненоНаСогласованииВДочерних</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ЗадачаПроцесса</name>
    <type>
      <types>CatalogRef.ЗадачиПроцесса</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидРесурса</name>
    <type>
      <types>CatalogRef.ВидыСогласуемыхРесурсов</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

conf/src/AccumulationRegisters/УчетВремени/УчетВремени.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>УчетВремени</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Длительность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>УДАЛИТЬЭтап</name>
    <type>
      <types>CatalogRef.РазделыПроекта</types>
    </type>
  </attributes>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидДеятельности</name>
    <type>
      <types>CatalogRef.ВидыДеятельности</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Этап</name>
    <type>
      <types>CatalogRef.РазделыПроекта</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТехническийПроект</name>
    <type>
      <types>CatalogRef.ТехническиеПроекты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Ошибка</name>
    <type>
      <types>CatalogRef.Ошибки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Задача</name>
    <type>
      <types>CatalogRef.ЗадачиПроцесса</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ОписаниеРаботы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>350</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

conf/src/InformationRegisters/СостоянияЗадачПроцессов/СостоянияЗадачПроцессов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СостоянияЗадачПроцессов</name>
  <resources>
    <name>МаксимальныйВозможныйСтатус</name>
    <type>
      <types>EnumRef.СтатусыЗадачПроцессов</types>
    </type>
  </resources>
  <resources>
    <name>Зона</name>
    <type>
      <types>EnumRef.ЗоныЗадач</types>
    </type>
  </resources>
  <attributes>
    <name>ЗначениеУпорядочивания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПредставлениеЗадачПредшественников</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Уровень</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МаксимальноеЗначениеУпорядочиванияНаУровне</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Состояние</name>
    <type>
      <types>EnumRef.СостоянияЗадачПроцессов</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаГотовностиКВыполнению</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <dimensions>
    <name>ЗадачаПроцесса</name>
    <type>
      <types>CatalogRef.ЗадачиПроцесса</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

conf/src/Enums/СтатусыТехническихПроектов/СтатусыТехническихПроектов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыТехническихПроектов</name>
  <enumValues>
    <name>НеЗапланирован</name>
  </enumValues>
  <enumValues>
    <name>Запланирован</name>
  </enumValues>
  <enumValues>
    <name>Активен</name>
  </enumValues>
  <enumValues>
    <name>Выполнен</name>
  </enumValues>
  <enumValues>
    <name>Отменен</name>
  </enumValues>
</mdclass:Enum>

conf/src/Enums/СтатусыЗадачПроцессов/СтатусыЗадачПроцессов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыЗадачПроцессов</name>
  <enumValues>
    <name>Запланирована</name>
  </enumValues>
  <enumValues>
    <name>ПринятаКВыполнению</name>
  </enumValues>
  <enumValues>
    <name>Выполнена</name>
  </enumValues>
  <enumValues>
    <name>Отменена</name>
  </enumValues>
</mdclass:Enum>

conf/src/Catalogs/ЗадачиШаблонаПроцесса/ЗадачиШаблонаПроцесса.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ЗадачиШаблонаПроцесса</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <owners>Catalog.ШаблоныПроцесса</owners>
  <attributes>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Контролирующий</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ПлановаяДлительность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗначениеУпорядочивания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидДеятельности</name>
    <type>
      <types>CatalogRef.ВидыДеятельности</types>
    </type>
  </attributes>
  <attributes>
    <name>СдвигПриоритета</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВозможнаОтменаОтветственнымЗаПредмет</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ПредшествующиеЗадачи</name>
    <attributes>
      <name>ПредшествующаяЗадача</name>
      <type>
        <types>CatalogRef.ЗадачиШаблонаПроцесса</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПланируемыеРесурсы</name>
    <attributes>
      <name>Планируется</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Ресурс</name>
      <type>
        <types>CatalogRef.ВидыСогласуемыхРесурсов</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

conf/src/DataProcessors/Планирование/Forms/РаспределениеНераспределенного/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОбработатьПереданныеПараметры(Отказ);
	ЗаполнитьТаблицуСортировки();
	
	УстановитьУсловноеОформление();
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьТаблицыРаспределения()
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапки

&НаКлиенте
Процедура ДекорацияДляКогоОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПерейтиПоНавигационнойСсылке(НавигационнаяСсылкаФорматированнойСтроки)
	
КонецПроцедуры

#КонецОбласти

#Область КомандыФормы

&НаКлиенте
Процедура Распределить(Команда)
	
	Закрыть(СтруктураВозврата());
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ОбработатьПереданныеПараметры(Отказ)
	
	Если Не ЗначениеЗаполнено(Параметры.Сотрудник) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Не указан пользователь для которого будет выполняться распределение.'"),,,, Отказ);
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Параметры.ДатаНачалаПериода) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Не указана дата начала периода планирования.'"),,,, Отказ);
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Параметры.ВидПлана) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Не указан вид плана.'"),,,, Отказ);
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Параметры.ВидСогласуемогоРесурсаПлановыхРабот) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Не указан вид планируемого ресурса.'"),,,, Отказ);
	КонецЕсли; 
	
	Если Не ЗначениеЗаполнено(Параметры.ДатыНачинаяС) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Не указаны возможные периоды начала распределения.'"),,,, Отказ);
	КонецЕсли;
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Сотрудник                                     = Параметры.Сотрудник;
	ДатаНачалаПериода                             = Параметры.ДатаНачалаПериода;
	ВидПлана                                      = Параметры.ВидПлана;
	ПороговоеЗначениеОтображениеЭтапПланЗанятости = Параметры.ПороговоеЗначениеОтображениеЭтапПланЗанятости;
	ВидСогласуемогоРесурсаПлановыхРабот           = Параметры.ВидСогласуемогоРесурсаПлановыхРабот;
	НормативПланируемогоВремени                   = Параметры.НормативПланируемогоВремени;
	
	Для Каждого ЭлементСписка Из Параметры.ДатыНачинаяС Цикл
		Элементы.РаспределятьНачинаяС.СписокВыбора.Добавить(ЭлементСписка.Значение, Формат(ЭлементСписка.Значение, "ДЛФ=D"));
	КонецЦикла;
	РаспределятьНачинаяС = Элементы.РаспределятьНачинаяС.СписокВыбора[0].Значение;
	
	СтрокаДляКого = СтроковыеФункции.ФорматированнаяСтрока(НСтр("ru = '<a href=""%1"">%2</a>'"),
	                                                       ПолучитьНавигационнуюСсылку(Сотрудник),
	                                                       СтрШаблон(НСтр("ru = 'Для %1'"),Строка(Сотрудник)));
	
	Элементы.ДекорацияДляКого.Заголовок = СтрокаДляКого;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицыРаспределения()

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ЗаписиПлана.Сотрудник КАК Сотрудник,
	|	ЗаписиПлана.Работа    КАК Работа 
	|ПОМЕСТИТЬ ЭтапыПоКоторымЕстьЗаписи
	|ИЗ
	|	РегистрСведений.ЗаписиПлана КАК ЗаписиПлана
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.Планы КАК Планы
	|		ПО (ЗаписиПлана.ИдентификаторПлана = Планы.ИдентификаторПлана
	|				И Планы.ВидПлана = &ВидПлана
	|				И Планы.НачалоПериода >= &ДатаНачалаПериода)
	|	ГДЕ ЗаписиПлана.Сотрудник = &Сотрудник 
	|;
	| 
	|////////////////////////////////////////////////////////////////////////////////1
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЗадачиПроцесса.Исполнитель           КАК Исполнитель,
	|	ЗадачиПроцесса.Ссылка                КАК Задача,
	|	ИерархияЗадачПроцесса.Родитель       КАК Родитель
	|ПОМЕСТИТЬ НевыполненныеЗадачиЭтапов
	|ИЗ
	|	Справочник.ЗадачиПроцесса КАК ЗадачиПроцесса
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ИерархияЗадачПроцесса КАК ИерархияЗадачПроцесса
	|		ПО ЗадачиПроцесса.Ссылка = ИерархияЗадачПроцесса.ЗадачаПроцесса
	|			И ИерархияЗадачПроцесса.Уровень = 0
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ТехническиеПроекты КАК ТехническиеПроекты
	|		ПО ЗадачиПроцесса.Предмет = ТехническиеПроекты.Ссылка
	|		И НЕ ТехническиеПроекты.ПометкаУдаления
	|		И ТехническиеПроекты.Статус В (ЗНАЧЕНИЕ(Перечисление.СтатусыТехническихПроектов.Запланирован), ЗНАЧЕНИЕ(Перечисление.СтатусыТехническихПроектов.Активен))
	|ГДЕ
	|	ЗадачиПроцесса.Исполнитель = &Сотрудник
	|	И ЗадачиПроцесса.Статус В (ЗНАЧЕНИЕ(Перечисление.СтатусыЗадачПроцессов.Запланирована), ЗНАЧЕНИЕ(Перечисление.СтатусыЗадачПроцессов.ПринятаКВыполнению))
	|	И НЕ ЗадачиПроцесса.ПометкаУдаления
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////2
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	НевыполненныеЗадачиЭтапов.Исполнитель                            КАК Исполнитель,
	|	НевыполненныеЗадачиЭтапов.Родитель                               КАК Родитель,
	|	СУММА(ЕСТЬNULL(ИтогиСогласованияЗадачРесурсов.Запланировано, 0)) КАК Запланировано,
	|	СУММА(ЕСТЬNULL(УчетВремени.Длительность, 0))                     КАК УчетВремениСекунды
	|ПОМЕСТИТЬ ЭтапыСотрудникаЗапланированоУчетВремени
	|ИЗ
	|	НевыполненныеЗадачиЭтапов КАК НевыполненныеЗадачиЭтапов
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИтогиСогласованияЗадачРесурсов КАК ИтогиСогласованияЗадачРесурсов
	|		ПО (ИтогиСогласованияЗадачРесурсов.ЗадачаПроцесса = НевыполненныеЗадачиЭтапов.Задача)
	|			И (ИтогиСогласованияЗадачРесурсов.ВидРесурса = &ВидСогласуемогоРесурсаПлановыхРабот)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.УчетВремени КАК УчетВремени
	|		ПО (УчетВремени.Задача = НевыполненныеЗадачиЭтапов.Задача)
	|			И (УчетВремени.Пользователь = НевыполненныеЗадачиЭтапов.Исполнитель)
	|			И (УчетВремени.Период < &ДатаНачалаПериода)
	|
	|СГРУППИРОВАТЬ ПО
	|	НевыполненныеЗадачиЭтапов.Родитель,
	|	НевыполненныеЗадачиЭтапов.Исполнитель
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////3
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЭтапыСотрудникаЗапланированоУчетВремени.Исполнитель                КАК Сотрудник,
	|	ВЫБОР 
	|		КОГДА ЗадачиПроцесса.ЗадачаШаблона = ЗНАЧЕНИЕ(Справочник.ЗадачиШаблонаПроцесса.ПустаяСсылка) 
	|			ТОГДА ЗадачиПроцесса.Предмет 
	|			ИНАЧЕ ЭтапыСотрудникаЗапланированоУчетВремени.Родитель
	|	КОНЕЦ                                                              КАК Этап,
	|	СУММА(ЭтапыСотрудникаЗапланированоУчетВремени.Запланировано)       КАК Запланировано,
	|	СУММА(ЭтапыСотрудникаЗапланированоУчетВремени.УчетВремениСекунды)  КАК УчетВремениСекунды
	|ПОМЕСТИТЬ ЭтапыСотрудникаДляОтображенияВПланах
	|ИЗ
	|	ЭтапыСотрудникаЗапланированоУчетВремени КАК ЭтапыСотрудникаЗапланированоУчетВремени
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ЗадачиПроцесса КАК ЗадачиПроцесса
	|		ПО (ЭтапыСотрудникаЗапланированоУчетВремени.Родитель = ЗадачиПроцесса.Ссылка) 
	|ГДЕ
	|	ЭтапыСотрудникаЗапланированоУчетВремени.Запланировано > &ПороговоеЗначениеДляЭтапаПоЗапланировано
	|	ИЛИ ЭтапыСотрудникаЗапланированоУчетВремени.УчетВремениСекунды > &ПороговоеЗначениеДляЭтапаПоФакт
	|СГРУППИРОВАТЬ ПО
	|	ЭтапыСотрудникаЗапланированоУчетВремени.Исполнитель,
	|	ВЫБОР 
	|		КОГДА ЗадачиПроцесса.ЗадачаШаблона = ЗНАЧЕНИЕ(Справочник.ЗадачиШаблонаПроцесса.ПустаяСсылка) 
	|			ТОГДА ЗадачиПроцесса.Предмет 
	|			ИНАЧЕ ЭтапыСотрудникаЗапланированоУчетВремени.Родитель
	|	 КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////4
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЭтапыСотрудникаДляОтображенияВПланах.Сотрудник КАК Сотрудник,
	|	ЭтапыСотрудникаДляОтображенияВПланах.Этап      КАК Этап,
	|	ЗадачиПроцесса.Ссылка                          КАК Задача,
	|	ЗадачиПроцесса.Исполнитель                     КАК ИсполнительЗадачи
	|ПОМЕСТИТЬ ЗадачиЭтапов
	|ИЗ
	|	ЭтапыСотрудникаДляОтображенияВПланах КАК ЭтапыСотрудникаДляОтображенияВПланах
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИерархияЗадачПроцесса КАК ИерархияЗадачПроцесса
	|		ПО ЭтапыСотрудникаДляОтображенияВПланах.Этап = ИерархияЗадачПроцесса.Родитель
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЗадачиПроцесса КАК ЗадачиПроцесса
	|		ПО (ИерархияЗадачПроцесса.ЗадачаПроцесса = ЗадачиПроцесса.Ссылка)
	|ГДЕ
	|	ЭтапыСотрудникаДляОтображенияВПланах.Этап ССЫЛКА Справочник.ЗадачиПроцесса
	|	И ЗадачиПроцесса.Исполнитель = &Сотрудник
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЭтапыСотрудникаДляОтображенияВПланах.Сотрудник КАК Сотрудник,
	|	ЭтапыСотрудникаДляОтображенияВПланах.Этап      КАК Этап,
	|	ЗадачиПроцесса.Ссылка                          КАК Задача,
	|	ЗадачиПроцесса.Исполнитель                     КАК ИсполнительЗадачи
	|ИЗ
	|	ЭтапыСотрудникаДляОтображенияВПланах КАК ЭтапыСотрудникаДляОтображенияВПланах
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ЗадачиПроцесса КАК ЗадачиПроцессаЭтапы
	|			ПО (ЭтапыСотрудникаДляОтображенияВПланах.Этап = ЗадачиПроцессаЭтапы.Предмет) 
	|			И ЗадачиПроцессаЭтапы.ЗадачаШаблона = ЗНАЧЕНИЕ(Справочник.ЗадачиШаблонаПроцесса.ПустаяСсылка)
	|				И ЗадачиПроцессаЭтапы.Родитель = ЗНАЧЕНИЕ(Справочник.ЗадачиПроцесса.ПустаяСсылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИерархияЗадачПроцесса КАК ИерархияЗадачПроцесса
	|		ПО ЗадачиПроцессаЭтапы.Ссылка = ИерархияЗадачПроцесса.Родитель
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЗадачиПроцесса КАК ЗадачиПроцесса
	|		ПО (ИерархияЗадачПроцесса.ЗадачаПроцесса = ЗадачиПроцесса.Ссылка)
	|ГДЕ
	|	ЭтапыСотрудникаДляОтображенияВПланах.Этап ССЫЛКА Справочник.ТехническиеПроекты
	|	И ЗадачиПроцесса.Исполнитель = &Сотрудник
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////5
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЗадачиЭтапов.Сотрудник                                    КАК Сотрудник,
	|	ЗадачиЭтапов.Этап                                         КАК Этап,
	|	ЗадачиЭтапов.Задача                                       КАК Задача,
	|	ЕСТЬNULL(ИтогиСогласованияЗадачРесурсов.Запланировано, 0) КАК Запланировано
	|ПОМЕСТИТЬ ЗапланированоПоЗадачам
	|ИЗ
	|	ЗадачиЭтапов КАК ЗадачиЭтапов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ЗадачиПроцесса КАК ЗадачиПроцесса
	|		ПО ЗадачиЭтапов.Задача = ЗадачиПроцесса.Ссылка
	|			И (НЕ ЗадачиПроцесса.ПометкаУдаления)
	|			И (ЗадачиПроцесса.Статус <> ЗНАЧЕНИЕ(Перечисление.СтатусыЗадачПроцессов.Отменена))
	|			И (ВЫБОР
	|				КОГДА ЗадачиПроцесса.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыЗадачПроцессов.Выполнена)
	|					ТОГДА ВЫБОР
	|							КОГДА ЗадачиПроцесса.ФактическаяДатаОкончания < &ДатаНачалаПериода
	|								ТОГДА ЛОЖЬ
	|							ИНАЧЕ ИСТИНА
	|						КОНЕЦ
	|				ИНАЧЕ ИСТИНА
	|			КОНЕЦ)
	|			И ЗадачиЭтапов.Сотрудник = ЗадачиПроцесса.Исполнитель
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИтогиСогласованияЗадачРесурсов КАК ИтогиСогласованияЗадачРесурсов
	|		ПО ЗадачиЭтапов.Задача = ИтогиСогласованияЗадачРесурсов.ЗадачаПроцесса
	|			И (ИтогиСогласованияЗадачРесурсов.ВидРесурса = &ВидСогласуемогоРесурсаПлановыхРабот)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////6
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЗадачиЭтапов.Сотрудник                       КАК Сотрудник,
	|	ЗадачиЭтапов.Этап                            КАК Этап,
	|	ЗадачиЭтапов.Задача                          КАК Задача,
	|	СУММА(ЕСТЬNULL(УчетВремени.Длительность, 0)) КАК Длительность
	|ПОМЕСТИТЬ ПотраченоПоЗадачам
	|ИЗ
	|	ЗадачиЭтапов КАК ЗадачиЭтапов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ЗадачиПроцесса КАК ЗадачиПроцесса
	|		ПО ЗадачиЭтапов.Задача = ЗадачиПроцесса.Ссылка
	|			И (НЕ ЗадачиПроцесса.ПометкаУдаления)
	|			И (ЗадачиПроцесса.Статус <> ЗНАЧЕНИЕ(Перечисление.СтатусыЗадачПроцессов.Отменена))
	|			И (ВЫБОР
	|				КОГДА ЗадачиПроцесса.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыЗадачПроцессов.Выполнена)
	|					ТОГДА ВЫБОР
	|							КОГДА ЗадачиПроцесса.ФактическаяДатаОкончания < &ДатаНачалаПериода
	|								ТОГДА ЛОЖЬ
	|							ИНАЧЕ ИСТИНА
	|						КОНЕЦ
	|				ИНАЧЕ ИСТИНА
	|			КОНЕЦ)
	|			И ЗадачиЭтапов.Сотрудник = ЗадачиПроцесса.Исполнитель
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.УчетВремени КАК УчетВремени
	|		ПО ЗадачиЭтапов.Задача = УчетВремени.Задача
	|		И УчетВремени.Период < &ДатаНачалаПериода
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗадачиЭтапов.Сотрудник,
	|	ЗадачиЭтапов.Этап,
	|	ЗадачиЭтапов.Задача
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////7
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЗапланированоПоЗадачам.Сотрудник КАК Сотрудник,
	|	ЗапланированоПоЗадачам.Этап      КАК Этап,
	|	СУММА(ВЫБОР
	|			КОГДА ЗапланированоПоЗадачам.Запланировано * 3600 > ПотраченоПоЗадачам.Длительность
	|				ТОГДА ЗапланированоПоЗадачам.Запланировано * 3600 - ПотраченоПоЗадачам.Длительность
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Остаток
	|ПОМЕСТИТЬ ОстатокКРаспределению
	|ИЗ
	|	ЗапланированоПоЗадачам КАК ЗапланированоПоЗадачам
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПотраченоПоЗадачам КАК ПотраченоПоЗадачам
	|		ПО ЗапланированоПоЗадачам.Сотрудник = ПотраченоПоЗадачам.Сотрудник
	|			И ЗапланированоПоЗадачам.Этап = ПотраченоПоЗадачам.Этап
	|			И ЗапланированоПоЗадачам.Задача = ПотраченоПоЗадачам.Задача
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗапланированоПоЗадачам.Сотрудник,
	|	ЗапланированоПоЗадачам.Этап
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Сотрудник,
	|	Этап
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////8
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	МАКСИМУМ(Планы.КонецПериода)  КАК ПланируемыеТрудозатраты	
	|ИЗ
	|	РегистрСведений.ЗаписиПлана КАК ЗаписиПлана
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.Планы КАК Планы
	|		ПО (Планы.ИдентификаторПлана = ЗаписиПлана.ИдентификаторПлана)
	|			И (Планы.ВидПлана = &ВидПлана)
	|			И (Планы.НачалоПериода >= &ДатаНачалаПериода)
	|ГДЕ
	|	ЗаписиПлана.Сотрудник = &Сотрудник
	|
	|;
	|////////////////////////////////////////////////////////////////////////////////9
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ 
	|	МИНИМУМ(Планы.НачалоПериода)               КАК НачалоПериода,
	|	СУММА(ЗаписиПлана.ПланируемыеТрудозатраты) КАК ПланируемыеТрудозатраты,
	|	ЭтапыСотрудникаДляОтображенияВПланах.Этап  КАК Этап
	|ПОМЕСТИТЬ ЗапланированоПланыЗанятости
	|ИЗ
	|	ЭтапыСотрудникаДляОтображенияВПланах КАК ЭтапыСотрудникаДляОтображенияВПланах
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЗаписиПлана КАК ЗаписиПлана
	|		ПО ЭтапыСотрудникаДляОтображенияВПланах.Этап = ЗаписиПлана.Работа
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.Планы КАК Планы
	|		ПО (Планы.ИдентификаторПлана = ЗаписиПлана.ИдентификаторПлана)
	|			И (Планы.ВидПлана = &ВидПлана)
	|			И (Планы.НачалоПериода >= &ДатаНачалаПериода)
	|ГДЕ
	|	ЗаписиПлана.Сотрудник = &Сотрудник
	|
	|СГРУППИРОВАТЬ ПО
	|	ЭтапыСотрудникаДляОтображенияВПланах.Этап
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////10
	|ВЫБРАТЬ
	|	ОстатокКРаспределению.Этап                                                                              КАК Этап,
	|	ОстатокКРаспределению.Остаток - ЕСТЬNULL(ЗапланированоПланыЗанятости.ПланируемыеТрудозатраты * 3600, 0) КАК Нераспределено
	|ПОМЕСТИТЬ НераспределенныеЭтапы
	|ИЗ
	|	ОстатокКРаспределению КАК ОстатокКРаспределению
	|		ЛЕВОЕ СОЕДИНЕНИЕ ЗапланированоПланыЗанятости КАК ЗапланированоПланыЗанятости
	|		ПО ОстатокКРаспределению.Этап = ЗапланированоПланыЗанятости.Этап
	|ГДЕ
	|	ОстатокКРаспределению.Остаток - ЕСТЬNULL(ЗапланированоПланыЗанятости.ПланируемыеТрудозатраты * 3600, 0) > 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////11
	|ВЫБРАТЬ
	|	ЭтапыСотрудникаДляОтображенияВПланах.Этап                                                  КАК Этап,
	|	ЕСТЬNULL(ЗадачиПроцесса.Статус, ЗНАЧЕНИЕ(Перечисление.СтатусыЗадачПроцессов.ПустаяСсылка)) КАК Статус,
	|	ЕСТЬNULL(ЗадачиПроцесса.ПлановаяДатаНачала, &ПустаяДата)                                   КАК ПлановаяДатаНачалаЗадача,
	|	ЕСТЬNULL(ЗадачиПроцесса.КрайняяДатаОкончания, &ПустаяДата)                                 КАК КрайняяДатаОкончанияЗадача,
	|	ЕСТЬNULL(ЗапланированоПланыЗанятости.НачалоПериода, &ДатаНепланировавшихсяЭтапов)          КАК ПерваяДатаПланаПоЭтапу,
	|	ЕСТЬNULL(ЗапланированоПланыЗанятости.ПланируемыеТрудозатраты, 0)                           КАК ПланируемыеТрудозатраты,
	|	ЕСТЬNULL(НераспределенныеЭтапы.Нераспределено, 0)                                          КАК Нераспределено,
	|	ВЫБОР
	|		КОГДА ЭтапыСотрудникаДляОтображенияВПланах.Этап ССЫЛКА Справочник.ЗадачиПроцесса
	|		ТОГДА ЕСТЬNULL(ТехническиеПроекты.Ссылка, ЗНАЧЕНИЕ(Справочник.ТехническиеПроекты.ПустаяСсылка))
	|		ИНАЧЕ ТехническиеПроектыЭтапыБезШаблона.Ссылка
	|	КОНЕЦ                                                                                      КАК ТехПроект,
	|	ВЫБОР
	|			КОГДА ЭтапыСотрудникаДляОтображенияВПланах.Этап ССЫЛКА Справочник.ЗадачиПроцесса
	|				ТОГДА ЕСТЬNULL(ТехническиеПроекты.Версия, ЗНАЧЕНИЕ(Справочник.ВерсииПроекта.ПустаяСсылка))
	|			ИНАЧЕ ТехническиеПроектыЭтапыБезШаблона.Версия
	|	КОНЕЦ                                                                                      КАК Версия,
	|	ВЫБОР
	|			КОГДА ЭтапыСотрудникаДляОтображенияВПланах.Этап ССЫЛКА Справочник.ЗадачиПроцесса
	|				ТОГДА ЕСТЬNULL(ТехническиеПроекты.ПлановаяДатаОкончания, &ПустаяДата)
	|			ИНАЧЕ ТехническиеПроектыЭтапыБезШаблона.ПлановаяДатаОкончания
	|	КОНЕЦ                                                                                      КАК ПлановаяДатаОкончанияТехПроект,
	|	ВЫБОР
	|			КОГДА ЭтапыСотрудникаДляОтображенияВПланах.Этап ССЫЛКА Справочник.ЗадачиПроцесса
	|				ТОГДА ЕСТЬNULL(ТехническиеПроекты.ПлановаяДатаНачала, &ПустаяДата)
	|			ИНАЧЕ ТехническиеПроектыЭтапыБезШаблона.ПлановаяДатаНачала
	|	КОНЕЦ                                                                                       КАК ПлановаяДатаНачалаТехПроект,
	|	ЕСТЬNULL(СостоянияЗадачПроцессов.ЗначениеУпорядочивания, 0)                                 КАК ЗначениеУпорядочивания
	|ИЗ
	|		ЭтапыСотрудникаДляОтображенияВПланах КАК ЭтапыСотрудникаДляОтображенияВПланах
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЗадачиПроцесса КАК ЗадачиПроцесса
	|			ПО ЭтапыСотрудникаДляОтображенияВПланах.Этап = ЗадачиПроцесса.Ссылка
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ТехническиеПроекты КАК ТехническиеПроекты
	|			ПО (ЗадачиПроцесса.Предмет = ТехническиеПроекты.Ссылка)
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ТехническиеПроекты КАК ТехническиеПроектыЭтапыБезШаблона
	|			ПО (ЭтапыСотрудникаДляОтображенияВПланах.Этап = ТехническиеПроектыЭтапыБезШаблона.Ссылка)
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СостоянияЗадачПроцессов КАК СостоянияЗадачПроцессов
	|			ПО ЭтапыСотрудникаДляОтображенияВПланах.Этап = СостоянияЗадачПроцессов.ЗадачаПроцесса
	|			ЛЕВОЕ СОЕДИНЕНИЕ ЗапланированоПланыЗанятости КАК ЗапланированоПланыЗанятости
	|			ПО ЭтапыСотрудникаДляОтображенияВПланах.Этап = ЗапланированоПланыЗанятости.Этап
	|			ЛЕВОЕ СОЕДИНЕНИЕ НераспределенныеЭтапы КАК НераспределенныеЭтапы
	|			ПО ЭтапыСотрудникаДляОтображенияВПланах.Этап = НераспределенныеЭтапы.Этап
	|УПОРЯДОЧИТЬ ПО
	|	ПерваяДатаПланаПоЭтапу,
	|	ПланируемыеТрудозатраты,
	|	ЗначениеУпорядочивания"; 
	
	Запрос.УстановитьПараметр("ВидПлана",                                 ВидПлана);
	Запрос.УстановитьПараметр("ПустаяДата",                               Дата(1,1,1));
	Запрос.УстановитьПараметр("ДатаНачалаПериода",                        ДатаНачалаПериода);
	Запрос.УстановитьПараметр("ДатаНепланировавшихсяЭтапов",              ДатаНепланировавшихсяЭтапов());
	Запрос.УстановитьПараметр("Сотрудник",                                Сотрудник);
	Запрос.УстановитьПараметр("ПороговоеЗначениеДляЭтапаПоЗапланировано", ПороговоеЗначениеОтображениеЭтапПланЗанятости);
	Запрос.УстановитьПараметр("ПороговоеЗначениеДляЭтапаПоФакт",          ПороговоеЗначениеОтображениеЭтапПланЗанятости);
	Запрос.УстановитьПараметр("ВидСогласуемогоРесурсаПлановыхРабот",      ВидСогласуемогоРесурсаПлановыхРабот);
	
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	ЗадачиПроцессов.ПоказатьВременнуюТаблицу(Запрос, "ЗапланированоПланыЗанятости");
	
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		НоваяСтрока = ТаблицаКРаспределению.Добавить();
		
		НоваяСтрока.Этап              = ?(ТипЗнч(Выборка.Этап) = Тип("СправочникСсылка.ТехническиеПроекты"), Справочники.ЗадачиПроцесса.ПустаяСсылка(), Выборка.Этап);
		НоваяСтрока.ТехническийПроект = Выборка.ТехПроект;
		НоваяСтрока.Версия            = Выборка.Версия;
		НоваяСтрока.Статус            = Выборка.Статус;
		НоваяСтрока.ДатаНачала        = ?(ТипЗнч(Выборка.Этап) = Тип("СправочникСсылка.ТехническиеПроекты"), Выборка.ПлановаяДатаНачалаТехПроект, Выборка.ПлановаяДатаНачалаЗадача);
		НоваяСтрока.ДатаОкончания     = ?(ТипЗнч(Выборка.Этап) = Тип("СправочникСсылка.ТехническиеПроекты"), Выборка.ПлановаяДатаОкончанияТехПроект, Выборка.КрайняяДатаОкончанияЗадача) ;
		НоваяСтрока.Нераспределено    = ПланированиеКлиентСервер.ЧасыПоДлительностиВСекундах(Выборка.Нераспределено);
		НоваяСтрока.Запланировано     = Выборка.ПланируемыеТрудозатраты;
		НоваяСтрока.ВПланахС          = Выборка.ПерваяДатаПланаПоЭтапу;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Функция СтруктураВозврата()
	
	Результат = Новый Структура;
	Результат.Вставить("Этапы",                       Новый Массив);
	Результат.Вставить("ВидПлана",                    ВидПлана);
	Результат.Вставить("ДатаНачалаПериода",           ДатаНачалаПериода);
	Результат.Вставить("Сотрудник",                   Сотрудник);
	Результат.Вставить("РаспределятьНачинаяС",        РаспределятьНачинаяС);
	Результат.Вставить("НормативПланируемогоВремени", НормативПланируемогоВремени);
	
	Для Каждого СтрокаТаблицы Из ТаблицаКРаспределению Цикл
		
		ДанныеЭтапа = Новый Структура;
		ДанныеЭтапа.Вставить("Этап", ?(ЗначениеЗаполнено(СтрокаТаблицы.Этап), СтрокаТаблицы.Этап, СтрокаТаблицы.ТехническийПроект));
		ДанныеЭтапа.Вставить("Нераспределено", СтрокаТаблицы.Нераспределено);
		
		Результат.Этапы.Добавить(ДанныеЭтапа);
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	ДатаНепланировавшихсяЭтапов = ДатаНепланировавшихсяЭтапов();
	
	//Этап не заполнен, это этапы верхнего уровня по проекту
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТаблицаКРаспределениюЭтап.Имя);
	
	ЭлементОтбора =  Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ТаблицаКРаспределению.Этап");
	ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.НеЗаполнено;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru = '<Задачи не по шаблону>'"));
	
	//Нераспределено больше 0
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТаблицаКРаспределениюНераспределено.Имя);
	
	ЭлементОтбора =  Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ТаблицаКРаспределению.Нераспределено");
	ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.Больше;
	ЭлементОтбора.ПравоеЗначение = 0;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ЗонаЗадачиКрасный); 
	
	//Нераспределено больше 0
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТаблицаКРаспределениюВПланахС.Имя);
	
	ЭлементОтбора =  Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ТаблицаКРаспределению.ВПланахС");
	ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ПравоеЗначение = ДатаНепланировавшихсяЭтапов;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru = '<не планировалось>'"));
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ЦветТекстаВыполненнойЗадачи);


КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицуСортировки()
	
	ДобавитьСтрокуТаблицыСортировки("ВПланахС",                  НСтр("ru = 'В планах с'"),              "Возр", Истина);
	ДобавитьСтрокуТаблицыСортировки("Версия",                    НСтр("ru = 'Версия'"),                  "Возр", Истина);
	ДобавитьСтрокуТаблицыСортировки("Запланировано",             НСтр("ru = 'Уже запланировано'"),       "Убыв", Ложь);
	ДобавитьСтрокуТаблицыСортировки("Нераспределено",            НСтр("ru = 'Нераспределено'") ,         "Убыв", Ложь);
	ДобавитьСтрокуТаблицыСортировки("ДатаНачала",                НСтр("ru = 'Плановая дата начала'"),    "Возр", Ложь);
	ДобавитьСтрокуТаблицыСортировки("ДатаОкончания",             НСтр("ru = 'Плановая дата окончания'"), "Возр", Ложь);
	
	ОтобразитьКартинкиСортировкиКолонкахТаблицы(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьСтрокуТаблицыСортировки(ПолеСортировки, ПредставлениеПоляСортировки, НаправлениеСортировки, Используется)
	
	НоваяСтрока = НастройкаСортировки.Добавить();
	НоваяСтрока.ПолеСортировки              = ПолеСортировки;
	НоваяСтрока.ПредставлениеПоляСортировки = ПредставлениеПоляСортировки;
	НоваяСтрока.НаправлениеСортировки       = НаправлениеСортировки;
	НоваяСтрока.ИспользуетсяПриСортировке   = Используется;
	
КонецПроцедуры

&НаСервере
Функция ДатаНепланировавшихсяЭтапов()

	Возврат ДобавитьМесяц(ДатаНачалаПериода, 36);

КонецФункции

&НаКлиенте
Процедура ПрименитьНастройкиСортировки(Команда)
	
	СтрокаСортировки = "";
	Для Каждого СтрокаТаблицыНастроек Из НастройкаСортировки Цикл
		
		Если СтрокаТаблицыНастроек.ИспользуетсяПриСортировке Тогда
			
			Если Не ПустаяСтрока(СтрокаСортировки) Тогда
				СтрокаСортировки = СтрокаСортировки + ",";
			КонецЕсли;
			
			СтрокаСортировки = СтрокаСортировки +СтрокаТаблицыНастроек.ПолеСортировки + " " + СтрокаТаблицыНастроек.НаправлениеСортировки;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если Не ПустаяСтрока(СтрокаСортировки) Тогда 
		ТаблицаКРаспределению.Сортировать(СтрокаСортировки);
	КонецЕсли; 
	
	ТекущийЭлемент = Элементы.ТаблицаКРаспределению;
	
	ОтобразитьКартинкиСортировкиКолонкахТаблицы(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ОтобразитьКартинкиСортировкиКолонкахТаблицы(Форма)
	
	Для Каждого СтрокаТаблицыСортировки Из Форма.НастройкаСортировки Цикл
		
		Если СтрокаТаблицыСортировки.ИспользуетсяПриСортировке Тогда
			
			Если СтрокаТаблицыСортировки.НаправлениеСортировки = "Возр" Тогда
				КартинкаШапки = БиблиотекаКартинок.СтрелкаВверх;
			Иначе
				КартинкаШапки = БиблиотекаКартинок.СтрелкаВниз;
			КонецЕсли;
			
		Иначе
			
			КартинкаШапки = Новый Картинка(); 
			
		КонецЕсли;
		
		Форма.Элементы["ТаблицаКРаспределению" + СтрокаТаблицыСортировки.ПолеСортировки].КартинкаШапки = КартинкаШапки;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
